tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "johngrib/johngrib"

brew "coreutils"
brew "bash"
brew "bat"
brew "curl"
brew "fzf"
brew "git"
brew "mas"
brew "node"
brew "tree"
brew "vim"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "gradle"
brew "wget"
brew "gnupg"
brew "fav"
brew "kubectx"
brew "c-bata/kube-prompt/kube-prompt"
brew "kubernetes-cli", link: false
brew "kubectx"

cask "docker"
cask "google-chrome"
cask "iterm2"
cask "hammerspoon"
cask "karabiner-elements"
cask "visual-studio-code"
cask "between"
cask "ferdi"
cask "nosqlbooster-for-mongodb"
cask "authy"
cask "jetbrains-toolbox"
cask "google-backup-and-sync"
cask "postman"
cask "appcleaner"
cask "notion"
cask "font-d2coding"

# Mac App Store (로그인 필요)
mas "KakaoTalk", id: 869223134
mas "Magnet", id: 441258766
mas "Slack", id: 803453959
mas "Allkdic", id: 1033453958
mas "Monosnap", id: 540348655
mas "Xcode", id: 497799835
